tutorial/DAInverse_tutorials/pehill-DA/pehill_base/constant/indexH.txt
0  17
0  0
0  18
0  34
1  51
1  34
1  52
1  68
2  68
2  51
2  69
2  85
3  102
3  85
3  103
3  119
4  903
4  886
4  904
4  920
5  40
5  23
5  39
5  41
5  57
6  108
6  91
6  107
6  109
6  125
7  158
7  141
7  157
7  159
7  175
8  175
8  158
8  174
8  176
8  192
9  192
9  175
9  191
9  193
9  209
10  209
10  192
10  208
10  210
10  226
11  226
11  209
11  225
11  227
11  243
12  925
12  908
12  924
12  926
12  942
13  28
13  11
13  27
13  29
13  45
14  198
14  181
14  197
14  199
14  215
15  147
15  130
15  146
15  148
15  164
16  215
16  198
16  214
16  216
16  232
17  249
17  232
17  248
17  250
17  761
18  249
18  232
18  248
18  250
18  761
19  947
19  930
19  946
19  948
19  964
20  118
20  101
20  117
20  135
20  351
21  186
21  169
21  185
21  203
21  415
22  220
22  203
22  219
22  237
22  447
23  254
23  237
23  253
23  479
23  766
24  766
24  254
24  765
24  783
24  1005
25  952
25  935
25  951
25  953
25  969
26  468
26  452
26  467
26  469
26  484
27  484
27  468
27  483
27  485
27  1010
28  1185
28  1169
28  1184
28  1186
28  1201
29  473
29  457
29  472
29  474
29  489
30  1015
30  489
30  1014
30  1016
30  1031
31  517
31  500
31  516
31  518
31  534
32  636
32  619
32  635
32  637
32  653
33  539
33  522
33  538
33  540
33  556
34  608
34  591
34  607
34  609
34  625
35  642
35  625
35  641
35  643
35  659
