tutorial/DAInverse_tutorials/pehill-DA/pehill_base/constant/obsLocations
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      obsLocations;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
(0.0 1.01 0.05)
(0.0 1.03 0.05)
(0.0 1.05 0.05)
(0.0 1.10 0.05)
(0.0 2.95 0.05)
(1.000000e+00 4.750986e-01 5.000000e-02)
(1.000000e+00 5.823824e-01 5.000000e-02)
(1.000000e+00 7.989498e-01 5.000000e-02)
(1.000000e+00 9.042336e-01 5.000000e-02)
(1.000000e+00 1.09e+00 5.000000e-02)
(1.000000e+00 1.226085e+00 5.000000e-02)
(1.000000e+00 1.440652e+00 5.000000e-02)
(1.000000e+00 2.982625e+00 5.000000e-02)
(2.000000e+00 1.54472e-02 5.000000e-02)
(2.000000e+00 6.00980e-01 5.000000e-02)
(2.000000e+00 2.982223e-01 5.000000e-02)
(2.000000e+00 8.015873e-01 5.000000e-02)
(2.000000e+00 1.263423e+00 5.000000e-02)
(2.000000e+00 1.510974e+00 5.000000e-02)
(2.000000e+00 2.996275e+00 5.000000e-02)
(3.000000e+00 1.494472e-01 5.000000e-02)
(3.000000e+00 4.732223e-01 5.000000e-02)
(3.000000e+00 8.920980e-01 5.000000e-02)
(3.000000e+00 1.257199e+00 5.000000e-02)
(3.000000e+00 1.510974e+00 5.000000e-02)
(3.000000e+00 2.982500e+00 5.000000e-02)
(4.000000e+00 1.015873e+00 5.000000e-02)
(4.000000e+00 1.500300e+00 5.000000e-02)
(4.000000e+00 2.972500e+00 5.000000e-02)
(5.000000e+00 1.01199e+00 5.000000e-02)
(5.000000e+00 1.57199e+00 5.000000e-02)
(7.000000e+00 2.567205e-02 5.000000e-02)
(7.000000e+00 2.732223e-01 5.000000e-02)
(8.000000e+00 4.774513e-01 5.000000e-02)
(8.000000e+00 6.012264e-01 5.000000e-02)
(8.000000e+00 7.250016e-01 5.000000e-02)
);
