tutorial/DAInverse_tutorials/pehill-DA/pehill_base/constant/weightH.txt
0.300589
0.299088
0.100829
0.299495
0.302028
0.299921
0.10142
0.296631
0.303357
0.298007
0.101713
0.296923
0.309184
0.295341
0.103585
0.29189
0.305113
0.302625
0.102625
0.289637
0.244847
0.223519
0.188804
0.0742735
0.268556
0.245914
0.198399
0.214173
0.0785676
0.262947
0.294416
0.283604
0.0837366
0.193439
0.144804
0.34014
0.253124
0.0891458
0.18631
0.13128
0.457706
0.144242
0.103659
0.142453
0.15194
0.561252
0.124244
0.0911394
0.133659
0.0897055
0.71114
0.0723112
0.0726428
0.0909455
0.0529601
0.323552
0.247077
0.0743635
0.0511859
0.303822
0.266141
0.260228
0.0696177
0.143871
0.260142
0.417342
0.2469
0.115914
0.125541
0.0943028
0.434956
0.189403
0.0756519
0.113616
0.186374
0.465232
0.183413
0.140249
0.125972
0.0851337
0.256146
0.288437
0.204906
0.159968
0.0905431
0.32657
0.0903206
0.323548
0.128826
0.130735
0.33995
0.220457
0.0422106
0.055207
0.342175
0.257582
0.227019
0.078934
0.22355
0.212915
0.381326
0.177512
0.0937659
0.155538
0.191858
0.329694
0.116611
0.134729
0.224218
0.194748
0.417157
0.15509
0.173795
0.173442
0.0805158
0.264356
0.268212
0.198885
0.0957707
0.172776
0.245605
0.232279
0.0765363
0.203922
0.241657
0.464269
0.125777
0.211666
0.117034
0.0812535
0.276212
0.0986706
0.235158
0.161896
0.228063
0.251123
0.246577
0.0765017
0.191381
0.234418
0.456833
0.129857
0.118484
0.213329
0.0814965
0.308975
0.177675
0.155462
0.26102
0.0968679
0.265404
0.252679
0.143214
0.0696696
0.269034
0.40415
0.250346
0.116893
0.0765092
0.152101
0.243074
0.221618
0.0745462
0.193076
0.267686
0.242117
0.277246
0.221394
0.0783797
0.180864
0.280021
0.282124
0.19116
0.081253
0.165441
