tutorial/DAInverse_tutorials/pehill-DA/pehill_base/0.org/Tau
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "5000";
    object      Tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
600
(
(1.47988e-07 -1.70212e-09 6.48284e-26 1.49656e-07 -1.40355e-26 1.48778e-07)
(2.922e-07 6.36095e-10 -1.6959e-24 2.87572e-07 -2.14679e-24 2.8967e-07)
(2.39887e-07 1.10072e-09 9.78898e-25 2.3203e-07 7.70104e-25 2.35875e-07)
(7.48742e-07 1.08127e-08 -1.14496e-23 7.11301e-07 -1.85838e-23 7.29848e-07)
(9.85477e-07 3.7596e-08 6.16962e-24 9.63926e-07 2.56798e-23 9.74648e-07)
(2.37756e-06 2.58638e-07 -6.53449e-24 2.39206e-06 6.47061e-25 2.38398e-06)
(5.14763e-06 2.91437e-07 6.83036e-26 5.76561e-06 -1.00592e-24 5.40135e-06)
(2.49352e-06 -1.65604e-07 -5.38936e-24 2.6108e-06 -2.92263e-24 2.55797e-06)
...
)
;

boundaryField
{
    topWall
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
40
(
(6.6669e-13 1.69919e-13 -1.70196e-33 6.66644e-13 -1.14472e-33 6.66667e-13)
(6.66485e-13 1.64729e-13 1.74477e-34 6.66815e-13 5.21459e-33 6.66667e-13)
(6.67047e-13 1.48852e-13 2.68514e-33 6.66419e-13 -4.0391e-33 6.66667e-13)
(6.67115e-13 1.3462e-13 7.04809e-33 6.66476e-13 -0 6.66667e-13)
(6.66937e-13 1.29998e-13 -4.10666e-32 6.66742e-13 -1.15856e-30 6.66667e-13)
(6.66835e-13 1.29934e-13 -6.51124e-33 6.66859e-13 1.84143e-32 6.66667e-13)
(6.66702e-13 1.30632e-13 1.07754e-34 6.66971e-13 -0 6.66667e-13)
(6.66705e-13 1.28843e-13 6.53766e-35 6.66887e-13 -0 6.66667e-13)
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
40
(
(5.98766e-13 -1.46976e-13 9.19812e-30 7.57929e-13 8.73947e-30 6.66667e-13)
(7.27154e-13 1.74411e-14 -6.72895e-29 6.22979e-13 -8.24507e-29 6.66667e-13)
(7.58719e-13 2.68094e-14 1.34175e-28 5.82388e-13 1.60496e-28 6.66667e-13)
(7.08131e-13 2.36975e-14 -1.02652e-28 6.2638e-13 -1.73871e-28 6.66667e-13)
(6.82701e-13 5.56509e-14 1.77817e-29 6.50698e-13 1.06778e-28 6.66667e-13)
(6.66079e-13 3.84578e-14 -5.98232e-31 6.66921e-13 -2.10049e-32 6.66667e-13)
(6.65932e-13 2.18205e-15 1.97648e-34 6.68118e-13 -2.81849e-34 6.66667e-13)
(6.66106e-13 -3.40376e-14 -2.69967e-35 6.67361e-13 -0 6.66667e-13)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
15
(
(2.5972e-07 -2.67022e-09 1.15329e-25 2.60898e-07 -2.09338e-26 2.59589e-07)
(4.45008e-06 -2.97928e-07 -9.13593e-24 4.50663e-06 -5.21201e-24 4.41243e-06)
(1.70034e-05 -4.69812e-06 -2.0627e-23 1.70235e-05 1.02629e-22 1.60572e-05)
(2.77276e-05 -8.43328e-06 2.85547e-23 2.33518e-05 -5.23451e-25 2.40613e-05)
(3.46249e-05 3.05692e-06 1.12967e-22 1.59677e-05 -3.57329e-22 3.10868e-05)
(3.45201e-05 1.33189e-05 5.76817e-21 1.49342e-05 3.98472e-23 3.55849e-05)
(2.91825e-05 9.01039e-06 -4.42326e-21 2.57831e-05 5.6831e-22 3.55323e-05)
(2.51915e-05 1.76223e-06 5.38323e-22 2.9917e-05 -1.60211e-22 2.83435e-05)
(1.5724e-05 -2.64948e-07 -3.51681e-22 1.78314e-05 1.12324e-23 1.59415e-05)
(8.9229e-06 1.86836e-06 5.36343e-23 1.00126e-05 -2.31842e-23 9.12677e-06)
(7.8654e-06 2.87171e-06 -0 8.28971e-06 9.17292e-25 7.98493e-06)
(8.05978e-06 2.7403e-06 -0 8.13781e-06 1.17819e-25 8.0713e-06)
(6.21778e-06 1.58006e-06 8.99861e-28 6.19924e-06 -4.10643e-26 6.20074e-06)
(1.07692e-06 7.04208e-08 3.16535e-27 1.07595e-06 -7.27792e-28 1.07619e-06)
(5.98857e-08 9.58101e-10 -1.88192e-29 5.98817e-08 7.02275e-30 5.98826e-08)
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
15
(
(2.17099e-07 -4.21053e-09 -2.31668e-31 2.15161e-07 -5.66083e-29 2.17099e-07)
(3.59229e-06 -3.25976e-07 -0 3.42266e-06 -3.66894e-29 3.59229e-06)
(1.32318e-05 -3.43015e-06 -0 1.13569e-05 -0 1.32318e-05)
(1.91503e-05 -5.1383e-06 -0 1.73155e-05 -0 1.91503e-05)
(2.41972e-05 -5.21663e-06 -0 2.18422e-05 6.24469e-27 2.41972e-05)
(2.90747e-05 -7.29937e-06 -0 2.75754e-05 -7.57042e-25 2.90747e-05)
(3.17384e-05 -1.03905e-05 1.45722e-23 3.49988e-05 2.41736e-24 3.17384e-05)
(2.87479e-05 -9.59885e-06 -0 3.61003e-05 4.45538e-24 2.87479e-05)
(1.74272e-05 -4.1565e-06 -6.89992e-23 2.42282e-05 -7.86349e-24 1.74272e-05)
(9.82821e-06 7.15353e-07 -0 1.32904e-05 -1.02387e-24 9.82821e-06)
(7.89612e-06 2.42992e-06 -0 9.11126e-06 2.64425e-24 7.89612e-06)
(7.57116e-06 2.28619e-06 -5.58722e-24 7.8543e-06 -2.85414e-24 7.57116e-06)
(5.8625e-06 1.34214e-06 2.03454e-24 5.90282e-06 2.36543e-25 5.8625e-06)
(1.0198e-06 7.2873e-08 -0 1.02027e-06 2.22837e-26 1.0198e-06)
(5.63458e-08 1.16559e-09 -0 5.63463e-08 -0 5.63458e-08)
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
