tutorial/DAInverse_tutorials/pehill-DA/pehill_base/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

eInit           8e-10;

//internalField   uniform $eInit; // paraview has problem with the variable
internalField   uniform 8e-10;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform 1e-14;
    }
    topWall
    {
        type            fixedValue;
        value           uniform 1e-14;
    }
    inlet
    {
        type            mapped;
        value           uniform 1e-14;
        interpolationScheme cell;
        setAverage      0;
        average         1e-14;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
