tutorial/DAInverse_tutorials/pehill-DA/pehill_base/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInit           3e-06;

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 3e-06;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform 1e-12;
    }
    topWall
    {
        type            fixedValue;
        value           uniform 1e-12;
    }
    inlet
    {
        type            mapped;
        value           uniform 1e-12;
        interpolationScheme cell;
        setAverage      0;
        average         1e-12;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
